readme.org
#+TITLE: Emacs Configurations on Windows 10
#+AUTHOR: Thach H. Pham
#+DESCRIPTION: Use Org-Babel to Configure Emacs 
#+LANGUAGE: en
#+PROPERTY: results silent

* Prerequisites:
** [[https://vigou3.gitlab.io/emacs-modified-windows/][Emacs Modified for Windows]]
** [[https://www.msys2.org/][MSYS2]]
** [[https://cran.r-project.org/][R]]
** [[https://yihui.org/tinytex/][TinyTex]]
** [[https://pandoc.org/installing.html][Pandoc]]
** [[https://languagetool.org/download/][LangTool]]
** [[https://www.java.com/en/download/][Java]]
** [[https://github.com/iaolo/iA-Fonts][iA-Fonts]]
** [[https://freefontsdownload.net/free-segoeuisymbol-font-135679.htm][Segoe UI Symbol]]
** [[https://graphviz.org/download/][Graphviz]]

* Packages & Configurations:
** Modus themes (~modus-themes~)

 #+BEGIN_SRC emacs-lisp
 (setq custom-safe-themes t)
 (load-theme 'modus-operandi)
 #+END_SRC

** Set default font

 #+BEGIN_SRC emacs-lisp
 ;; invoke `eval-last-sexp' for (w32-select-font)
 (set-face-attribute 'default nil  :font "iA Writer Quattro S-12")
 #+END_SRC

** Fixed-pitch fonts

 #+BEGIN_SRC emacs-lisp
 (set-face-attribute 'variable-pitch nil :font "iA Writer Quattro S-13")
 (set-face-attribute 'fixed-pitch nil :font "iA Writer Mono S-12")
 (set-face-attribute 'default nil :font "iA Writer Mono S-12")
 (set-fontset-font nil 'symbol (font-spec :family "Segoe UI Symbol" :size 12.0))
 (add-hook 'text-mode-hook 'variable-pitch-mode)
 #+END_SRC
 
** Org-Bullets (~org-bullets~)

 #+BEGIN_SRC emacs-lisp
 (require 'org-bullets)
 (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
 #+END_SRC

** Ivy mode (~ivy~)

 #+BEGIN_SRC emacs-lisp
 ;; Enable Ivy mode in general
 (ivy-mode 1)
 (setq ivy-use-virtual-buffers t)
 (setq enable-recursive-minibuffers t)
 #+END_SRC

** Counsel & Swiper (~counsel~ & ~swiper~)

 #+BEGIN_SRC emacs-lisp
 ;; Add Counsel and Swiper search functions
 (global-set-key (kbd "C-c f r") #'counsel-recentf)
 (global-set-key (kbd "C-c C-s") #'swiper)

 ;; Replace default "M-x" and "C-x C-f" with Counsel version
 (global-set-key (kbd "M-x") #'counsel-M-x)
 (global-set-key (kbd "C-x C-f") #'counsel-find-file)

 ;; Replace describe-function and describe-variable with Counsel version
 (global-set-key (kbd "C-h f") 'counsel-describe-function)
 (global-set-key (kbd "C-h v") 'counsel-describe-variable)
 #+END_SRC

** Olivetti (~olivetti~)

 #+BEGIN_SRC emacs-lisp
 ;; Set the body text width
 (setq olivetti-body-width 80)

 ;; Enable Olivetti for text-related mode such as Org Mode
 (add-hook 'text-mode-hook 'olivetti-mode)
 #+END_SRC

** Additional aesthetic

 #+BEGIN_SRC emacs-lisp
 (setq inhibit-startup-screen t)
 (setq inhibit-startup-echo-area-message t)
 (setq inhibit-startup-message t)
 (setq initial-scratch-message nil)
 (setq initial-major-mode 'org-mode)
 (setq-default indent-tabs-mode nil)
 (setq pop-up-windows nil)
 (tool-bar-mode 0) 
 (tooltip-mode  1)
 (scroll-bar-mode 0)
 (menu-bar-mode 0) ;menu bar is explicitly turned on for beginners. Change the value to 0.

 ;; Line cursor and no blink
 (set-default 'cursor-type  '(bar . 1))
 (blink-cursor-mode 0)

 ;; Line spacing, can be 0 for code and 1 or 2 for text
 (setq-default line-spacing 2)

 ;; Underline line at descent position, not baseline position
 (setq x-underline-at-descent-line t)
 #+END_SRC

** Stop Emacs littering with #file# and file~

 #+BEGIN_SRC emacs-lisp
 ;; Avoid #file.org# to appear
 (auto-save-visited-mode)
 (setq create-lockfiles nil)

 ;; Avoid filename.ext~ to appear
 (setq make-backup-files nil)
 #+END_SRC

** Turn on highlighting the pair of parenthesis 

#+BEGIN_SRC emacs-lisp
 (show-paren-mode 1)
#+END_SRC

** LangTool (~langtool~)

 #+BEGIN_SRC emacs-lisp
 (setq langtool-language-tool-jar  "D:/LanguageTool-5.2/languagetool-commandline.jar")
 (require 'langtool)
 (setq langtool-java-bin "C:/Program Files/Java/jre1.8.0_281/bin/java.exe")
 (setq langtool-default-language "en-US")
 #+END_SRC

** LaTeX

 #+BEGIN_SRC emacs-lisp
(setq org-latex-create-formula-image-program 'dvipng)

;; PDF export
(setq org-latex-pdf-process (list "latexmk -shell-escape -bibtex -f -pdf %f"))

 #+END_SRC

** Org-Babel

 #+BEGIN_SRC emacs-lisp
(org-babel-do-load-languages
 'org-babel-load-languages
 '(
   (latex . t)
   (R . t)
  ))
 #+END_SRC

** Org-Roam (~org-roam~)

 #+BEGIN_SRC emacs-lisp
 ;; Tell Emacs where sqlite3.exe is stored
 (add-to-list 'exec-path "D:/Emacs/bin/sqlite-tools-win32-x86-3350200")

 ;; Org-roam directory
 (setq org-roam-directory "D:/Git.New/WORG/Roam")

 ;; Tell Emacs to start org-roam-mode when Emacs starts
 (add-hook 'after-init-hook 'org-roam-mode)

 ;; Define key bindings for Org-roam
 (global-set-key (kbd "C-c n r") #'org-roam-buffer-toggle-display)
 (global-set-key (kbd "C-c n i") #'org-roam-insert)
 (global-set-key (kbd "C-c n /") #'org-roam-find-file)
 (global-set-key (kbd "C-c n b") #'org-roam-switch-to-buffer)
 (global-set-key (kbd "C-c n d") #'org-roam-find-directory)

 ;; Recommendation for Windows users for performance
 (setq org-roam-db-update-method 'immediate)

 ;; Let's also assign C-z to undo here
 (global-set-key (kbd "C-z") 'undo) ;Emacs default is bound to hide Emacs.
 #+END_SRC

** Org-Roam Graph

 #+BEGIN_SRC emacs-lisp
;; UTF-8 as default encoding
(set-language-environment "UTF-8")

;; Path to Graphviz
(setq org-roam-graph-executable "D:/Emacs/bin/stable_windows_10_msbuild_Release_Win32_graphviz-2.47.0-win32/Graphviz/bin/dot.exe")

;; Display graphs in Chrome
(setq org-roam-graph-viewer "C:/Program Files/Google/Chrome/Application/chrome.exe")
 #+END_SRC

** Org-Ref & Org-Roam-Bibtex (ORB)

 #+BEGIN_SRC emacs-lisp
 ;; Set up bibliography
 (setq org-ref-default-bibliography '("D:/Git.New/WORG/bibtex.bib"))
 (setq bibtex-completion-bibliography "D:/Git.New/WORG/bibtex.bib")
 (global-set-key (kbd "<f6>") #'org-ref-helm-insert-cite-link)

 ;; Org-roam-bibtex
 (require `org-roam-bibtex)
 (add-hook 'after-init-hook #'org-roam-bibtex-mode)
 (define-key org-roam-bibtex-mode-map (kbd "C-c n a") #'orb-note-actions)
 #+END_SRC

** Org-Noter (~org-noter~)

 #+BEGIN_SRC emacs-lisp
 (setq org-noter-notes-search-path '("D:/Git.New/WORG/Roam/Notes"))
 (setq org-noter-always-create-frame nil)
 (setq org-noter-separate-notes-from-heading t)
 #+END_SRC
   
** PDF-Tools (~pdf-tools~, ~M-x pdf-tools-install RET~)

 #+BEGIN_SRC emacs-lisp
 (pdf-loader-install)
 ;; Auto revert
 ;; (add-hook 'TeX-after-compilation-finished-functions  #'TeX-revert-document-buffer)
 #+END_SRC

** Open PDF file stored in Windows' standard Zotero storage

 #+BEGIN_SRC emacs-lisp
 (setq bibtex-completion-pdf-field "File")
 #+END_SRC

** Transpose-Frame (~transpose-frame~)

* Structure Templates
** Org-Tempo

 #+BEGIN_SRC emacs-lisp
 (require 'org-tempo)
 #+END_SRC
 
* Defined Functions:
** Show LanguageTool report automatically by popup

 #+BEGIN_SRC emacs-lisp
 (defun langtool-autoshow-detail-popup (overlays)
   (when (require 'popup nil t)
     ;; Do not interrupt current popup
     (unless (or popup-instances
                 ;; suppress popup after type `C-g` .
                 (memq last-command '(keyboard-quit)))
       (let ((msg (langtool-details-error-message overlays)))
         (popup-tip msg)))))

 (setq langtool-autoshow-message-function
      'langtool-autoshow-detail-popup)
 #+END_SRC

* References:
** [[https://github.com/nobiot/Zero-to-Emacs-and-Org-roam][From Zero to Emacs and Org-Roam]]
** [[https://github.com/rougier/elegant-emacs][Elegant Emacs]]
** [[https://xvrdm.github.io/2017/05/29/a-minimal-emacs-setup-with-orgmode/][A minimal emacs setup with orgmode]] 
** [[https://write.as/dani/notes-on-org-noter][Notes on Org-noter]]

    
